nxp-mcuxpresso/mcuxsdk-examples/_boards/imx95lp4xevk15/common/pin_mux/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitXSPI1Pins:
- options: {callFromInitBoot: 'false', coreID: cm7}
- pin_list:
  - {pin_num: AJ45, peripheral: FLEXSPI1, signal: 'flexspi_a_data_bit, 0', pin_signal: XSPI1_DATA0, PD: DISABLED, FSEL1: SlOW_SLEW_RATE, DSE: X6}
  - {pin_num: AH46, peripheral: FLEXSPI1, signal: 'flexspi_a_data_bit, 1', pin_signal: XSPI1_DATA1, PD: DISABLED, FSEL1: SlOW_SLEW_RATE, DSE: X6}
  - {pin_num: AJ47, peripheral: FLEXSPI1, signal: 'flexspi_a_data_bit, 2', pin_signal: XSPI1_DATA2, PD: DISABLED, FSEL1: SlOW_SLEW_RATE, DSE: X6}
  - {pin_num: AK48, peripheral: FLEXSPI1, signal: 'flexspi_a_data_bit, 3', pin_signal: XSPI1_DATA3, PD: DISABLED, FSEL1: SlOW_SLEW_RATE, DSE: X6}
  - {pin_num: AJ49, peripheral: FLEXSPI1, signal: 'flexspi_a_data_bit, 4', pin_signal: XSPI1_DATA4, PD: DISABLED, FSEL1: SlOW_SLEW_RATE, DSE: X6}
  - {pin_num: AK50, peripheral: FLEXSPI1, signal: 'flexspi_a_data_bit, 5', pin_signal: XSPI1_DATA5, PD: DISABLED, FSEL1: SlOW_SLEW_RATE, DSE: X6}
  - {pin_num: AJ51, peripheral: FLEXSPI1, signal: 'flexspi_a_data_bit, 6', pin_signal: XSPI1_DATA6, PD: DISABLED, FSEL1: SlOW_SLEW_RATE, DSE: X6}
  - {pin_num: AH50, peripheral: FLEXSPI1, signal: 'flexspi_a_data_bit, 7', pin_signal: XSPI1_DATA7, PD: DISABLED, FSEL1: SlOW_SLEW_RATE, DSE: X6}
  - {pin_num: AJ43, peripheral: FLEXSPI1, signal: flexspi_a_sclk, pin_signal: XSPI1_SCLK, PD: DISABLED, FSEL1: SlOW_SLEW_RATE, DSE: X6}
  - {pin_num: AJ41, peripheral: FLEXSPI1, signal: 'flexspi_a_ss_b, 0', pin_signal: XSPI1_SS0_B, PD: DISABLED, FSEL1: SlOW_SLEW_RATE, DSE: X6}
  - {pin_num: AH42, peripheral: FLEXSPI1, signal: 'flexspi_a_ss_b, 1', pin_signal: XSPI1_SS1_B, PD: DISABLED, FSEL1: SlOW_SLEW_RATE, DSE: X6}
  - {pin_num: AK44, peripheral: FLEXSPI1, signal: flexspi_a_dqs, pin_signal: XSPI1_DQS, PD: DISABLED, FSEL1: SlOW_SLEW_RATE, DSE: X6}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitXSPI1Pins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitXSPI1Pins(void) {                           /*!< Function assigned for the core: Cortex-M7F[cm7] */
    HAL_PinctrlSetPinMux(HAL_PINCTRL_PLATFORM_IOMUXC_PAD_XSPI1_DATA0__FLEXSPI1_A_DATA0_BIT0, 0U);
    HAL_PinctrlSetPinCfg(HAL_PINCTRL_PLATFORM_IOMUXC_PAD_XSPI1_DATA0__FLEXSPI1_A_DATA0_BIT0, 
                        HAL_PINCTRL_PLATFORM_IOMUXC_PAD_DSE(63U));
    HAL_PinctrlSetPinMux(HAL_PINCTRL_PLATFORM_IOMUXC_PAD_XSPI1_DATA1__FLEXSPI1_A_DATA0_BIT1, 0U);
    HAL_PinctrlSetPinCfg(HAL_PINCTRL_PLATFORM_IOMUXC_PAD_XSPI1_DATA1__FLEXSPI1_A_DATA0_BIT1, 
                        HAL_PINCTRL_PLATFORM_IOMUXC_PAD_DSE(63U));
    HAL_PinctrlSetPinMux(HAL_PINCTRL_PLATFORM_IOMUXC_PAD_XSPI1_DATA2__FLEXSPI1_A_DATA0_BIT2, 0U);
    HAL_PinctrlSetPinCfg(HAL_PINCTRL_PLATFORM_IOMUXC_PAD_XSPI1_DATA2__FLEXSPI1_A_DATA0_BIT2, 
                        HAL_PINCTRL_PLATFORM_IOMUXC_PAD_DSE(63U));
    HAL_PinctrlSetPinMux(HAL_PINCTRL_PLATFORM_IOMUXC_PAD_XSPI1_DATA3__FLEXSPI1_A_DATA0_BIT3, 0U);
    HAL_PinctrlSetPinCfg(HAL_PINCTRL_PLATFORM_IOMUXC_PAD_XSPI1_DATA3__FLEXSPI1_A_DATA0_BIT3, 
                        HAL_PINCTRL_PLATFORM_IOMUXC_PAD_DSE(63U));
    HAL_PinctrlSetPinMux(HAL_PINCTRL_PLATFORM_IOMUXC_PAD_XSPI1_DATA4__FLEXSPI1_A_DATA0_BIT4, 0U);
    HAL_PinctrlSetPinCfg(HAL_PINCTRL_PLATFORM_IOMUXC_PAD_XSPI1_DATA4__FLEXSPI1_A_DATA0_BIT4, 
                        HAL_PINCTRL_PLATFORM_IOMUXC_PAD_DSE(63U));
    HAL_PinctrlSetPinMux(HAL_PINCTRL_PLATFORM_IOMUXC_PAD_XSPI1_DATA5__FLEXSPI1_A_DATA0_BIT5, 0U);
    HAL_PinctrlSetPinCfg(HAL_PINCTRL_PLATFORM_IOMUXC_PAD_XSPI1_DATA5__FLEXSPI1_A_DATA0_BIT5, 
                        HAL_PINCTRL_PLATFORM_IOMUXC_PAD_DSE(63U));
    HAL_PinctrlSetPinMux(HAL_PINCTRL_PLATFORM_IOMUXC_PAD_XSPI1_DATA6__FLEXSPI1_A_DATA0_BIT6, 0U);
    HAL_PinctrlSetPinCfg(HAL_PINCTRL_PLATFORM_IOMUXC_PAD_XSPI1_DATA6__FLEXSPI1_A_DATA0_BIT6, 
                        HAL_PINCTRL_PLATFORM_IOMUXC_PAD_DSE(63U));
    HAL_PinctrlSetPinMux(HAL_PINCTRL_PLATFORM_IOMUXC_PAD_XSPI1_DATA7__FLEXSPI1_A_DATA0_BIT7, 0U);
    HAL_PinctrlSetPinCfg(HAL_PINCTRL_PLATFORM_IOMUXC_PAD_XSPI1_DATA7__FLEXSPI1_A_DATA0_BIT7, 
                        HAL_PINCTRL_PLATFORM_IOMUXC_PAD_DSE(63U));
    HAL_PinctrlSetPinMux(HAL_PINCTRL_PLATFORM_IOMUXC_PAD_XSPI1_DQS__FLEXSPI1_A_DQS, 0U);
    HAL_PinctrlSetPinCfg(HAL_PINCTRL_PLATFORM_IOMUXC_PAD_XSPI1_DQS__FLEXSPI1_A_DQS, 
                        HAL_PINCTRL_PLATFORM_IOMUXC_PAD_DSE(63U));
    HAL_PinctrlSetPinMux(HAL_PINCTRL_PLATFORM_IOMUXC_PAD_XSPI1_SCLK__FLEXSPI1_A_SCLK, 0U);
    HAL_PinctrlSetPinCfg(HAL_PINCTRL_PLATFORM_IOMUXC_PAD_XSPI1_SCLK__FLEXSPI1_A_SCLK, 
                        HAL_PINCTRL_PLATFORM_IOMUXC_PAD_DSE(63U));
    HAL_PinctrlSetPinMux(HAL_PINCTRL_PLATFORM_IOMUXC_PAD_XSPI1_SS0_B__FLEXSPI1_A_SS0_B, 0U);
    HAL_PinctrlSetPinCfg(HAL_PINCTRL_PLATFORM_IOMUXC_PAD_XSPI1_SS0_B__FLEXSPI1_A_SS0_B, 
                        HAL_PINCTRL_PLATFORM_IOMUXC_PAD_DSE(63U));
    HAL_PinctrlSetPinMux(HAL_PINCTRL_PLATFORM_IOMUXC_PAD_XSPI1_SS1_B__FLEXSPI1_A_SS1_B, 0U);
    HAL_PinctrlSetPinCfg(HAL_PINCTRL_PLATFORM_IOMUXC_PAD_XSPI1_SS1_B__FLEXSPI1_A_SS1_B, 
                        HAL_PINCTRL_PLATFORM_IOMUXC_PAD_DSE(63U));
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitI3C1Pins:
- options: {callFromInitBoot: 'false', coreID: cm7}
- pin_list:
  - {pin_num: D48, peripheral: I3C1, signal: i3c_scl, pin_signal: I2C1_SCL, SION: ENABLED, PD: ENABLED}
  - {pin_num: D52, peripheral: I3C1, signal: i3c_sda, pin_signal: I2C1_SDA, SION: ENABLED, PD: ENABLED}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitI3C1Pins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitI3C1Pins(void) {                            /*!< Function assigned for the core: Cortex-M7F[cm7] */
    HAL_PinctrlSetPinMux(HAL_PINCTRL_PLATFORM_IOMUXC_PAD_I2C1_SCL__I3C1_SCL, 1U);
    HAL_PinctrlSetPinCfg(HAL_PINCTRL_PLATFORM_IOMUXC_PAD_I2C1_SCL__I3C1_SCL, 
                        HAL_PINCTRL_PLATFORM_IOMUXC_PAD_DSE(15U) |
                        HAL_PINCTRL_PLATFORM_IOMUXC_PAD_FSEL1(2U) |
                        HAL_PINCTRL_PLATFORM_IOMUXC_PAD_PD_MASK);
    HAL_PinctrlSetPinMux(HAL_PINCTRL_PLATFORM_IOMUXC_PAD_I2C1_SDA__I3C1_SDA, 1U);
    HAL_PinctrlSetPinCfg(HAL_PINCTRL_PLATFORM_IOMUXC_PAD_I2C1_SDA__I3C1_SDA, 
                        HAL_PINCTRL_PLATFORM_IOMUXC_PAD_DSE(15U) |
                        HAL_PINCTRL_PLATFORM_IOMUXC_PAD_FSEL1(2U) |
                        HAL_PINCTRL_PLATFORM_IOMUXC_PAD_PD_MASK);
}


